##################
# Standard Brews & Taps
##################

brew "argp-standalone"
brew "fzf"
brew "helix"
brew "lazygit"
brew "oh-my-posh"
brew "mas"
brew "premake"
brew "stow"
brew "zinit"

tap "dart-lang/dart"
brew "dart"

##################
# Casks (Mac OS applications)
##################

cask "1password"
cask "appzapper"
cask "betterdisplay"
cask "craft"
cask "crossover"
cask "daisydisk"
cask "discord"
cask "dropbox"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "istat-menus"
cask "karabiner-elements"
cask "lm-studio"
cask "logi-options+"
cask "steam"
cask "tailscale"
cask "vivaldi"
cask "zed"

##################
# Mac App Store installations
##################

mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
